[
  {
    "id": 0,
    "name": "Kokomi",
    "description": "Sangonomiya Kokomi is a playable Hydro character in Genshin Impact. The young Divine Priestess of Watatsumi Island and a descendant of the Sangonomiya Clan. Kokomi is in charge of most of Watatsumi's affairs, shouldering heavy responsibilities alone in hopes for giving Watatsumi Island's people the hopes and happiness that they desire.",
    "talentID": 0,
    "photo": "images/Kokomi.png",
    "banner": "images/Kokomi_Banner.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 1,
    "name": "Diona",
    "description": "Diona Katzlein is a playable Cryo character in Genshin Impact. Despite being a bartender at Cat's Tail, she actually despises alcohol and wants nothing more than to ruin Mondstadt's wine industry—a feat easier said than done when her patrons absolutely love her drinks. She is the daughter of Draff, a hunter in Springvale.",
    "talentID": 1,
    "photo": "images/Diona.png",
    "banner": "images/Diona_Banner.png",
    "type": "char",
    "stars": 4,
    "mine": 0
  },
  {
    "id": 2,
    "name": "Eula",
    "description": "Eula Lawrence is a playable Cryo character in Genshin Impact. A descendant of the infamous and tyrannical Lawrence Clan and niece of Schubert, Eula is the captain of the Reconnaissance Company with the Knights of Favonius.",
    "talentID": 2,
    "photo": "images/Eula.png",
    "banner": "images/Eula_Banner.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 3,
    "name": "Xiangling",
    "description": "Mao Xiangling is a playable Pyro character in Genshin Impact. She is the Head Chef at the Wanmin Restaurant and runs it alongside her father Chef Mao. As a chef, Xiangling isn't afraid to try out different recipes or 'exotic' ingredients... making her dishes sometimes quite unique.",
    "talentID": 3,
    "photo": "images/Xiangling.png",
    "banner": "images/Xiangling_Banner.png",
    "type": "char",
    "stars": 4,
    "mine": 0
  },
  {
    "id": 4,
    "name": "Xinqgiu",
    "description": "Xingqiu is a playable Hydro character in Genshin Impact. He is the second son of the Guild Manager of the Feiyun Commerce Guild, an influential group in Liyue, and is also a self-proclaimed practitioner of the Guhua Clan's arts.",
    "talentID": 4,
    "photo": "images/Xingqiu.png",
    "banner": "images/Xingqiu_Banner.png",
    "type": "char",
    "stars": 4,
    "mine": 0
  },
  {
    "id": 5,
    "name": "Shogun Raiden",
    "description": "The Raiden Shogun, real name Raiden Ei, is a playable Electro character in Genshin Impact. She is the vessel of Beelzebul, the current Electro Archon of Inazuma, and meditates inside the Plane of Euthymia while letting her puppet control the daily affairs of the nation.",
    "talentID": 5,
    "photo": "images/Shogun_Raiden.png",
    "banner": "images/Shogun_Raiden_Banner.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 6,
    "name": "Luxurious Sea-Lord",
    "description": "Luxurious Sea-Lord is a 4-Star claymore obtainable from the Moonlight Merriment event.",
    "talentID": 8,
    "photo": "images/Luxurious_Sea-Lord.png",
    "banner": "images/Luxurious_Sea-Lord_Banner.png",
    "type": "weapon",
    "stars": 4,
    "mine": 0
  },
  {
    "id": 7,
    "name": "Prototype Amber",
    "description": "Prototype Amber is a Liyue catalyst.",
    "talentID": 7,
    "photo": "images/Prototype_Amber.png",
    "banner": "images/Prototype_Amber_Banner.png",
    "type": "weapon",
    "stars": 4,
    "mine": 0
  },
  {
    "id": 8,
    "name": "Favonius Sword",
    "description": "Favonius Sword is a 4-Star sword.",
    "talentID": 6,
    "photo": "images/Favonius_Sword.png",
    "banner": "images/Favonius_Sword_Banner.png",
    "type": "weapon",
    "stars": 4,
    "mine": 0
  },
  {
    "id": 9,
    "name": "Ayaka",
    "description": "Kamisato Ayaka is a playable Cryo character in Genshin Impact. She is the oldest daughter of the Kamisato Clan and sister of Kamisato Ayato. Being beautiful, elegant, and graceful, the common folk have nothing to bad-mouth Ayaka about. Because of her social status as the eldest daughter of the Kamisato Clan of the Yashiro Commission and as the Shirasagi Himegimi, Ayaka is seen as a model of perfection.",
    "talentID": 9,
    "photo": "images/Ayaka.png",
    "banner": "images/Banner_Ayaka.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 10,
    "name": "Bennett",
    "description": "Bennett is a playable Pyro character in Genshin Impact. An orphan discovered by an elderly adventurer as a baby, Bennett was raised in Mondstadt's Adventurers' Guild. He is the one and only member of 'Benny's Adventure Team,' as everyone else left the team after experiencing the constant misfortune that follows him.",
    "talentID": 2,
    "photo": "images/Bennett.png",
    "banner": "images/Banner_Bennett.png",
    "type": "char",
    "stars": 4,
    "mine": 0
  },
  {
    "id": 11,
    "name": "Ganyu",
    "description": "Ganyu is a playable Cryo character in Genshin Impact. She is a half-qilin Adeptus under contract with the Geo Archon Morax and serves as the general secretary of the Liyue Qixing. Ganyu first appears in Teyvat Chapter Storyline Chapter 1, Act 2: Farewell, the Archaic Lord.",
    "talentID": 3,
    "photo": "images/Ganyu.jpeg",
    "banner": "images/Banner_Ganyu.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 12,
    "name": "Hu Tao",
    "description": "Hu Tao  is a playable Pyro character in Genshin Impact. She is the 77th Director of the Wangsheng Funeral Parlor.",
    "talentID": 3,
    "photo": "images/Hu_Tao.png",
    "banner": "images/Banner_Hu_Tao.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 13,
    "name": "Arataki Itto",
    "description": "Arataki Itto is a playable Geo character in Genshin Impact. A descendant of the crimson oni, Itto is also the leader and founder of the Arataki Gang.",
    "talentID": 9,
    "photo": "images/Arataki_Itto.png",
    "banner": "images/Banner_Arataki_Itto.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 14,
    "name": "Kazuha Kaedehara",
    "description": "Kaedehara Kazuha is a playable Anemo character in Genshin Impact. A wandering samurai of the once-famed Kaedehara Clan, Kazuha is a temporary crewmember of The Crux.",
    "talentID": 3,
    "photo": "images/Kazuha.png",
    "banner": "images/Banner_Kazuha.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 15,
    "name": "Venti",
    "description": "Venti is a playable Anemo character in Genshin Impact. He is a free-spirited, wine-loving bard in Mondstadt and the current mortal vessel of Barbatos, the Anemo Archon.",
    "talentID": 10,
    "photo": "images/Venti.png",
    "banner": "images/Banner_Venti.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 16,
    "name": "Xiao",
    "description": "Xiao is a playable Anemo character in Genshin Impact. He is an adeptus, under the name Alatus, and the only known remaining member of the five foremost Yakshas dispatched by Morax to subdue the demonic spirits that plagued Liyue. He currently resides in Wangshu Inn and mostly secludes himself from crowds and human interactions.",
    "talentID": 11,
    "photo": "images/Xiao.png",
    "banner": "images/Banner_Xiao.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 17,
    "name": "Zhongli",
    "description": "Zhongli is a playable Geo character in Genshin Impact. He is later revealed to be the current vessel of the Geo Archon, Morax, who has decided to experience the world from the perspective of a mortal. After giving up his Gnosis, he retires from his position as an Archon and returns to his former identity as an Adeptus, although still under the guise of being a human. He currently works as a consultant of the Wangsheng Funeral Parlor.",
    "talentID": 4,
    "photo": "images/Zhongli.jpeg",
    "banner": "images/Banner_Zhongli.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 18,
    "name": "Albedo",
    "description": "Albedo, also known as the 'Kreideprinz' is a playable Geo character in Genshin Impact. A synthetic human made by the alchemist Rhinedottir, the mysterious Albedo is the Chief Alchemist and Captain of the Investigation Team of the Knights of Favonius. Through a recommendation from the adventurer Alice, with Sucrose as his assistant, he holds an infinite desire to learn about the world of Teyvat, carefully studying every object around him.",
    "talentID": 10,
    "photo": "images/Albedo.jpeg",
    "banner": "images/Banner_Albedo.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 19,
    "name": "Beidou",
    "description": "Beidou is a playable Electro character in Genshin Impact. She is the captain of The Crux, a renowned crew in Liyue. Besides her capabilities as a fleet captain and her immense strength, many in Liyue know her for her lack of fear towards the Tianquan of the Liyue Qixing, Ningguang — a trait that the other appreciates, yet grows irritated by.",
    "talentID": 4,
    "photo": "images/Beidou.png",
    "banner": "images/Banner_Beidou.png",
    "type": "char",
    "stars": 4,
    "mine": 0
  }
]