[
  {
    "id": 0,
    "name": "Kokomi",
    "description": "Sangonomiya Kokomi is a playable Hydro character in Genshin Impact. The young Divine Priestess of Watatsumi Island and a descendant of the Sangonomiya Clan. Kokomi is in charge of most of Watatsumi's affairs, shouldering heavy responsibilities alone in hopes for giving Watatsumi Island's people the hopes and happiness that they desire.",
    "talentID": 0,
    "photo": "images/Kokomi.png",
    "banner": "images/Kokomi_Banner.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 1,
    "name": "Diona",
    "description": "Diona Katzlein is a playable Cryo character in Genshin Impact. Despite being a bartender at Cat's Tail, she actually despises alcohol and wants nothing more than to ruin Mondstadt's wine industry—a feat easier said than done when her patrons absolutely love her drinks. She is the daughter of Draff, a hunter in Springvale.",
    "talentID": 1,
    "photo": "images/Diona.png",
    "banner": "images/Diona_Banner.png",
    "type": "char",
    "stars": 4,
    "mine": 0
  },
  {
    "id": 2,
    "name": "Eula",
    "description": "Eula Lawrence is a playable Cryo character in Genshin Impact. A descendant of the infamous and tyrannical Lawrence Clan and niece of Schubert, Eula is the captain of the Reconnaissance Company with the Knights of Favonius.",
    "talentID": 2,
    "photo": "images/Eula.png",
    "banner": "images/Eula_Banner.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 3,
    "name": "Xiangling",
    "description": "Mao Xiangling is a playable Pyro character in Genshin Impact. She is the Head Chef at the Wanmin Restaurant and runs it alongside her father Chef Mao. As a chef, Xiangling isn't afraid to try out different recipes or 'exotic' ingredients... making her dishes sometimes quite unique.",
    "talentID": 3,
    "photo": "images/Xiangling.png",
    "banner": "images/Xiangling_Banner.png",
    "type": "char",
    "stars": 4,
    "mine": 0
  },
  {
    "id": 4,
    "name": "Xinqgiu",
    "description": "Xingqiu is a playable Hydro character in Genshin Impact. He is the second son of the Guild Manager of the Feiyun Commerce Guild, an influential group in Liyue, and is also a self-proclaimed practitioner of the Guhua Clan's arts.",
    "talentID": 4,
    "photo": "images/Xingqiu.png",
    "banner": "images/Xingqiu_Banner.png",
    "type": "char",
    "stars": 4,
    "mine": 0
  },
  {
    "id": 5,
    "name": "Shogun Raiden",
    "description": "The Raiden Shogun, real name Raiden Ei, is a playable Electro character in Genshin Impact. She is the vessel of Beelzebul, the current Electro Archon of Inazuma, and meditates inside the Plane of Euthymia while letting her puppet control the daily affairs of the nation.",
    "talentID": 5,
    "photo": "images/Shogun_Raiden.png",
    "banner": "images/Shogun_Raiden_Banner.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 6,
    "name": "Luxurious Sea-Lord",
    "description": "Luxurious Sea-Lord is a 4-Star claymore obtainable from the Moonlight Merriment event.",
    "talentID": 8,
    "photo": "images/Luxurious_Sea-Lord.png",
    "banner": "images/Luxurious_Sea-Lord_Banner.png",
    "type": "weapon",
    "stars": 4,
    "mine": 0
  },
  {
    "id": 7,
    "name": "Prototype Amber",
    "description": "Prototype Amber is a Liyue catalyst.",
    "talentID": 7,
    "photo": "images/Prototype_Amber.png",
    "banner": "images/Prototype_Amber_Banner.png",
    "type": "weapon",
    "stars": 4,
    "mine": 0
  },
  {
    "id": 8,
    "name": "Favonius Sword",
    "description": "Favonius Sword is a 4-Star sword.",
    "talentID": 6,
    "photo": "images/Favonius_Sword.png",
    "banner": "images/Favonius_Sword_Banner.png",
    "type": "weapon",
    "stars": 4,
    "mine": 0
  },
  {
    "id": 9,
    "name": "Ayaka",
    "description": "Kamisato Ayaka is a playable Cryo character in Genshin Impact. She is the oldest daughter of the Kamisato Clan and sister of Kamisato Ayato. Being beautiful, elegant, and graceful, the common folk have nothing to bad-mouth Ayaka about. Because of her social status as the eldest daughter of the Kamisato Clan of the Yashiro Commission and as the Shirasagi Himegimi, Ayaka is seen as a model of perfection.",
    "talentID": 9,
    "photo": "images/Ayaka.png",
    "banner": "images/Banner_Ayaka.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 10,
    "name": "Bennett",
    "description": "Bennett is a playable Pyro character in Genshin Impact. An orphan discovered by an elderly adventurer as a baby, Bennett was raised in Mondstadt's Adventurers' Guild. He is the one and only member of 'Benny's Adventure Team,' as everyone else left the team after experiencing the constant misfortune that follows him.",
    "talentID": 2,
    "photo": "images/Bennett.png",
    "banner": "images/Banner_Bennett.png",
    "type": "char",
    "stars": 4,
    "mine": 0
  },
  {
    "id": 11,
    "name": "Ganyu",
    "description": "Ganyu is a playable Cryo character in Genshin Impact. She is a half-qilin Adeptus under contract with the Geo Archon Morax and serves as the general secretary of the Liyue Qixing. Ganyu first appears in Teyvat Chapter Storyline Chapter 1, Act 2: Farewell, the Archaic Lord.",
    "talentID": 3,
    "photo": "images/Ganyu.jpeg",
    "banner": "images/Banner_Ganyu.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 12,
    "name": "Hu Tao",
    "description": "Hu Tao  is a playable Pyro character in Genshin Impact. She is the 77th Director of the Wangsheng Funeral Parlor.",
    "talentID": 3,
    "photo": "images/Hu_Tao.png",
    "banner": "images/Banner_Hu_Tao.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 13,
    "name": "Arataki Itto",
    "description": "Arataki Itto is a playable Geo character in Genshin Impact. A descendant of the crimson oni, Itto is also the leader and founder of the Arataki Gang.",
    "talentID": 9,
    "photo": "images/Arataki_Itto.png",
    "banner": "images/Banner_Arataki_Itto.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 14,
    "name": "Kazuha Kaedehara",
    "description": "Kaedehara Kazuha is a playable Anemo character in Genshin Impact. A wandering samurai of the once-famed Kaedehara Clan, Kazuha is a temporary crewmember of The Crux.",
    "talentID": 3,
    "photo": "images/Kazuha.png",
    "banner": "images/Banner_Kazuha.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 15,
    "name": "Venti",
    "description": "Venti is a playable Anemo character in Genshin Impact. He is a free-spirited, wine-loving bard in Mondstadt and the current mortal vessel of Barbatos, the Anemo Archon.",
    "talentID": 10,
    "photo": "images/Venti.png",
    "banner": "images/Banner_Venti.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 16,
    "name": "Xiao",
    "description": "Xiao is a playable Anemo character in Genshin Impact. He is an adeptus, under the name Alatus, and the only known remaining member of the five foremost Yakshas dispatched by Morax to subdue the demonic spirits that plagued Liyue. He currently resides in Wangshu Inn and mostly secludes himself from crowds and human interactions.",
    "talentID": 11,
    "photo": "images/Xiao.png",
    "banner": "images/Banner_Xiao.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 17,
    "name": "Zhongli",
    "description": "Zhongli is a playable Geo character in Genshin Impact. He is later revealed to be the current vessel of the Geo Archon, Morax, who has decided to experience the world from the perspective of a mortal. After giving up his Gnosis, he retires from his position as an Archon and returns to his former identity as an Adeptus, although still under the guise of being a human. He currently works as a consultant of the Wangsheng Funeral Parlor.",
    "talentID": 4,
    "photo": "images/Zhongli.jpeg",
    "banner": "images/Banner_Zhongli.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 18,
    "name": "Albedo",
    "description": "Albedo, also known as the 'Kreideprinz' is a playable Geo character in Genshin Impact. A synthetic human made by the alchemist Rhinedottir, the mysterious Albedo is the Chief Alchemist and Captain of the Investigation Team of the Knights of Favonius. Through a recommendation from the adventurer Alice, with Sucrose as his assistant, he holds an infinite desire to learn about the world of Teyvat, carefully studying every object around him.",
    "talentID": 10,
    "photo": "images/Albedo.jpeg",
    "banner": "images/Banner_Albedo.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 19,
    "name": "Beidou",
    "description": "Beidou is a playable Electro character in Genshin Impact. She is the captain of The Crux, a renowned crew in Liyue. Besides her capabilities as a fleet captain and her immense strength, many in Liyue know her for her lack of fear towards the Tianquan of the Liyue Qixing, Ningguang — a trait that the other appreciates, yet grows irritated by.",
    "talentID": 4,
    "photo": "images/Beidou.png",
    "banner": "images/Banner_Beidou.png",
    "type": "char",
    "stars": 4,
    "mine": 0
  },
  {
    "id": 20,
    "name": "Tartaglia (Childe)",
    "description": "Tartaglia, also known by his alias 'Childe', is a playable Hydro character in Genshin Impact. He is the Eleventh of the Fatui Harbingers. Following danger wherever he goes, Childe is always eager for a challenge, making him extremely dangerous despite being the youngest member.",
    "talentID": 1,
    "photo": "images/Tartaglia.png",
    "banner": "images/Banner_Tartaglia.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 21,
    "name": "Diluc",
    "description": "Diluc Ragnvindr is a playable Pyro character in Genshin Impact. Born into the affluent Ragnvindr Clan, Diluc is the current owner of the Dawn Winery and a nobleman of high esteem in Mondstadt society. While a past incident caused him to split ways with the Knights of Favonius, he continues to protect Mondstadt in his own way.",
    "talentID": 2,
    "photo": "images/Diluc.png",
    "banner": "images/Banner_Diluc.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 22,
    "name": "Fischl",
    "description": "Fischl von Luftschloss Narfidort, real name Amy, is a playable Electro character in Genshin Impact. Fischl is an investigator for Mondstadt's Adventurers' Guild, accompanied by the night raven Oz. Fischl claims to hail from a world beyond Teyvat. She is a daring adventurer with seemingly outlandish theories that happen to turn out to be true.",
    "talentID": 10,
    "photo": "images/Fischl.png",
    "banner": "images/Banner_Fischl.png",
    "type": "char",
    "stars": 4,
    "mine": 0
  },
  {
    "id": 23,
    "name": "Jean",
    "description": "Jean Gunnhildr is a playable Anemo character in Genshin Impact. The daughter of Frederica Gunnhildr and Seamus Pegg, the older sister of Barbara, and a descendant of the prestigious Gunnhildr Clan, Jean is the Acting Grand Master of the Knights of Favonius. She is always busy handling unrest across Mondstadt and tirelessly working to maintain the City of Freedom.",
    "talentID": 2,
    "photo": "images/Jean.png",
    "banner": "images/Banner_Jean.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 24,
    "name": "Mona",
    "description": "Astrologist Mona Megistus is a playable Hydro character in Genshin Impact. An astrologist of great skill and equally-great pride, Mona has taken up residence in Mondstadt to avoid incurring the wrath of her master after unwittingly reading the latter's diary.",
    "talentID": 2,
    "photo": "images/Mona.png",
    "banner": "images/Banner_Mona.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 25,
    "name": "Shenhe",
    "description": "Shenhe is a playable Cryo character in Genshin Impact. The daughter of an unnamed exorcist couple, Shenhe was taken in by Cloud Retainer as a disciple following a traumatic incident during her childhood.",
    "talentID": 11,
    "photo": "images/Shenhe.png",
    "banner": "images/Banner_Shenhe.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 26,
    "name": "Sucrose",
    "description": "Sucrose is a playable Anemo character in Genshin Impact. An alchemist specializing in bio-alchemy, she also serves as an assistant for Albedo, the head alchemist of the Knights of Favonius.",
    "talentID": 1,
    "photo": "images/Sucrose.png",
    "banner": "images/Banner_Sucrose.png",
    "type": "char",
    "stars": 4,
    "mine": 0
  },
  {
    "id": 27,
    "name": "Yae Miko",
    "description": "Yae Miko, also known as Guuji Yae or the Guuji, is a playable Electro character in Genshin Impact. Miko oversees the Grand Narukami Shrine and is the owner of the Yae Publishing House.",
    "talentID": 5,
    "photo": "images/Yae_Miko.png",
    "banner": "images/Banner_Yae_Miko.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 28,
    "name": "Yoimiya",
    "description": "Naganohara Yoimiya is a playable Pyro character in Genshin Impact. She is the daughter of Naganohara Ryuunosuke and the current owner of Naganohara Fireworks. With her colorful fireworks and outgoing personality, Yoimiya is beloved by everyone on Narukami Island, who believes summer is not the same without her.",
    "talentID": 0,
    "photo": "images/Yoimiya.png",
    "banner": "images/Banner_Yoimiya.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 29,
    "name": "Traveler (Electro)",
    "description": "The Traveler is the playable protagonist of Genshin Impact. At the beginning of the game, both genders are twin siblings from another world, traveling throughout the universe, until an unknown god blocked and captured one of them, and sealed their power to travel, leaving them stranded on Teyvat. They are accompanied by a travel companion named Paimon throughout their journey. Although players can choose the name they want to be referred by, the Traveler's Sibling (whichever twin not chosen at the start of the game) refers to the Traveler by either Aether or Lumine (depending on the gender of the player's chosen twin), regardless of their custom name.",
    "talentID": 0,
    "photo": "images/Traveler_Electro.png",
    "banner": "images/Banner_Traveler_Electro.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 30,
    "name": "Gorou",
    "description": "Gorou is a playable Geo character in Genshin Impact. He is the courageous and reliable general of the Watatsumi Army, a leader whose men can always place their trust in.",
    "talentID": 5,
    "photo": "images/Gorou.png",
    "banner": "images/Banner_Gorou.png",
    "type": "char",
    "stars": 4,
    "mine": 0
  },
  {
    "id": 31,
    "name": "Kaeya",
    "description": "Kaeya Alberich is a playable Cryo character in Genshin Impact. Kaeya is the Cavalry Captain of the Knights of Favonius. He is held in high regard by the people of Mondstadt — even with all his eccentricities and secrets. He is obtained in the Prologue, Act I: The Outlander Who Caught the Wind during the quest Crash Course.",
    "talentID": 10,
    "photo": "images/Kaeya.png",
    "banner": "images/Banner_Kaeya.png",
    "type": "char",
    "stars": 4,
    "mine": 0
  },
  {
    "id": 32,
    "name": "Keqing",
    "description": "Keqing is a playable Electro character in Genshin Impact. As the Yuheng of the Liyue Qixing, she is someone who seeks her own answers instead of idly letting chaos run amok in Liyue. She chooses her own path with her own power and ability, instead of letting the gods determine her fate.",
    "talentID": 11,
    "photo": "images/Keqing.png",
    "banner": "images/Banner_Keqing.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 33,
    "name": "Klee",
    "description": "Klee is a playable Pyro character in Genshin Impact. The daughter of the intrepid and often quite destructive adventurer Alice, Klee takes after her mother in many ways, much to the dismay of the Knights of Favonius whom she has been entrusted to.",
    "talentID": 1,
    "photo": "images/Klee.png",
    "banner": "images/Banner_Klee.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 34,
    "name": "Kujou Sara",
    "description": "Kujou Sara is a playable Electro character in Genshin Impact. A tengu, Sara is the adopted daughter of the Kujou Clan of the Tenryou Commission. Loyal to both her clan and the Shogun, Kujou Sara carries out her orders to the Shogun's will.",
    "talentID": 9,
    "photo": "images/Kujou_Sara.png",
    "banner": "images/Banner_Kujou_Sara.png",
    "type": "char",
    "stars": 4,
    "mine": 0
  },
  {
    "id": 35,
    "name": "Ningguang",
    "description": "Ningguang is a playable Geo character in Genshin Impact. She is the Tianquan of the Liyue Qixing and owns the floating Jade Chamber in the skies of Liyue.",
    "talentID": 11,
    "photo": "images/Ningguang.png",
    "banner": "images/Banner_Ningguang.png",
    "type": "char",
    "stars": 4,
    "mine": 0
  },
  {
    "id": 36,
    "name": "Noelle",
    "description": "Noelle is a playable Geo character in Genshin Impact. While not yet a knight, she seeks to one day join the Knights of Favonius by first serving as a dutiful maid.",
    "talentID": 2,
    "photo": "images/Noelle.png",
    "banner": "images/Banner_Noelle.png",
    "type": "char",
    "stars": 4,
    "mine": 0
  },
  {
    "id": 37,
    "name": "Razor",
    "description": "Razor is a playable Electro character in Genshin Impact. Abandoned as an infant, Razor was taken in by the Wolf of the North, Andrius, and raised by his wolf pack in Wolvendom. After a chance encounter with Varka, the current Grand Master of the Knights of Favonius and the Knight of Boreas, he has slowly started integrating with humans again.",
    "talentID": 2,
    "photo": "images/Razor.png",
    "banner": "images/Banner_Razor.png",
    "type": "char",
    "stars": 4,
    "mine": 0
  },
  {
    "id": 38,
    "name": "Rosaria",
    "description": "Rosaria is a playable Cryo character in Genshin Impact. She is a member of the Church of Favonius in Mondstadt.",
    "talentID": 10,
    "photo": "images/Rosaria.png",
    "banner": "images/Banner_Rosaria.png",
    "type": "char",
    "stars": 4,
    "mine": 0
  },
  {
    "id": 39,
    "name": "Sayu",
    "description": "Sayu is a playable Anemo character in Genshin Impact. A ninja from the Shuumatsuban that is struggling with growing tall. Sayu believes that sleeping can help her growth, which is why she prefers to use her ninja techniques to hide and 'laze around'.",
    "talentID": 5,
    "photo": "images/Sayu.png",
    "banner": "images/Banner_Sayu.png",
    "type": "char",
    "stars": 4,
    "mine": 0
  },
  {
    "id": 40,
    "name": "Thoma",
    "description": "Thoma is a playable Pyro character in Genshin Impact. Hailing from Mondstadt, he is the housekeeper for the Kamisato Clan, and also a well-known 'fixer' in Inazuma.",
    "talentID": 0,
    "photo": "images/Thoma.png",
    "banner": "images/Banner_Thoma.png",
    "type": "char",
    "stars": 4,
    "mine": 0
  },
  {
    "id": 41,
    "name": "Yanfei",
    "description": "Yanfei is a playable Pyro character in Genshin Impact. She is the child of an adeptus father and human mother. After she grew up, her parents left to go on an adventure, placing her in the care of Madame Ping. She resides in Liyue, serving as a legal advisor for its people.",
    "talentID": 4,
    "photo": "images/Yanfei.png",
    "banner": "images/Banner_Yanfei.png",
    "type": "char",
    "stars": 4,
    "mine": 0
  },
  {
    "id": 42,
    "name": "Yun Jin",
    "description": "Yun Jin is a playable Geo character in Genshin Impact. She is a prestigious dancer, singer, and brewer who works at the Heyu Tea House.",
    "talentID": 3,
    "photo": "images/Yun_Jin.png",
    "banner": "images/Banner_Yun_Jin.png",
    "type": "char",
    "stars": 4,
    "mine": 0
  },
  {
    "id": 43,
    "name": "Aloy",
    "description": "Aloy is a playable Cryo crossover character in Genshin Impact. She is the heroine from Horizon Zero Dawn and is introduced as a collaboration and crossover character between Guerrilla Games and miHoYo.",
    "talentID": 1,
    "photo": "images/Aloy.png",
    "banner": "images/Banner_Aloy.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 44,
    "name": "Barbara",
    "description": "Barbara Pegg is a playable Hydro character in Genshin Impact. She is the deaconess of the Church of Favonius and a self-proclaimed 'idol' after learning about them from the intrepid adventurer Alice. She is also the daughter of Frederica Gunnhildr and Seamus Pegg, and the younger sister of Jean. Through Frederica she is a descendant of the prestigious Gunnhildr Clan. She can be obtained for free in the Baptism of Song Event by completing the quest A Long Shot during the Prologue Act III: Song of the Dragon and Freedom.",
    "talentID": 1,
    "photo": "images/Barbara.png",
    "banner": "images/Banner_Barbara.png",
    "type": "char",
    "stars": 4,
    "mine": 0
  },
  {
    "id": 45,
    "name": "Chongyun",
    "description": "Chongyun is a playable Cryo character in Genshin Impact. An exorcist from Liyue, Chongyun was born with excessive yang (positive) energy, which has proven to be both a help and a hindrance. It makes him a very effective exorcist, but it also means he has never seen a spirit for himself — they flee before he can even lay eyes on them. It has also made him particularly susceptible to any kind of heat or strong emotion, which leads to some rather... unexpected results.",
    "talentID": 3,
    "photo": "images/Chongyun.png",
    "banner": "images/Banner_Chongyun.png",
    "type": "char",
    "stars": 4,
    "mine": 0
  },
  {
    "id": 46,
    "name": "Traveler (Geo)",
    "description": "The Traveler is the playable protagonist of Genshin Impact. At the beginning of the game, both genders are twin siblings from another world, traveling throughout the universe, until an unknown god blocked and captured one of them, and sealed their power to travel, leaving them stranded on Teyvat. They are accompanied by a travel companion named Paimon throughout their journey. Although players can choose the name they want to be referred by, the Traveler's Sibling (whichever twin not chosen at the start of the game) refers to the Traveler by either Aether or Lumine (depending on the gender of the player's chosen twin), regardless of their custom name.",
    "talentID": 1,
    "photo": "images/Traveler_Geo.png",
    "banner": "images/Banner_Traveler_Geo.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 47,
    "name": "Qiqi",
    "description": "Qiqi is a playable Cryo character in Genshin Impact. Resurrected as a zombie by the adepti, she has ended up in Baizhu's care and now works at Bubu Pharmacy in Liyue Harbor.",
    "talentID": 11,
    "photo": "images/Qiqi.png",
    "banner": "images/Banner_Qiqi.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 48,
    "name": "Amber",
    "description": "Amber is a playable Pyro character in Genshin Impact. As the only remaining Outrider of the Knights of Favonius, she is always ready to help the citizens of Mondstadt — whether it be something simple or perhaps a more challenging task. She can be obtained for free in the Prologue Act I: The Outlander Who Caught the Wind during the quest Winds of the Past.",
    "talentID": 1,
    "photo": "images/Amber.png",
    "banner": "images/Banner_Amber.png",
    "type": "char",
    "stars": 4,
    "mine": 0
  },
  {
    "id": 49,
    "name": "Traveler (Anemo)",
    "description": "The Traveler is the playable protagonist of Genshin Impact. At the beginning of the game, both genders are twin siblings from another world, traveling throughout the universe, until an unknown god blocked and captured one of them, and sealed their power to travel, leaving them stranded on Teyvat. They are accompanied by a travel companion named Paimon throughout their journey. Although players can choose the name they want to be referred by, the Traveler's Sibling (whichever twin not chosen at the start of the game) refers to the Traveler by either Aether or Lumine (depending on the gender of the player's chosen twin), regardless of their custom name.",
    "talentID": 1,
    "photo": "images/Traveler_Anemo.png",
    "banner": "images/Banner_Traveler_Anemo.png",
    "type": "char",
    "stars": 5,
    "mine": 0
  },
  {
    "id": 50,
    "name": "Lisa",
    "description": "Lisa Minci is a playable Electro character in Genshin Impact. A powerful mage recognized as Sumeru Academia's most distinguished graduate in 200 years, Lisa has since returned to Mondstadt to become the humble Librarian of the Knights of Favonius. She can be obtained for free in the Prologue Act I: The Outlander Who Caught the Wind during the quest Sparks Amongst the Pages.",
    "talentID": 10,
    "photo": "images/Lisa.png",
    "banner": "images/Banner_Lisa.png",
    "type": "char",
    "stars": 4,
    "mine": 0
  },
  {
    "id": 51,
    "name": "Xinyan",
    "description": "Xinyan is a playable Pyro character in Genshin Impact. Rock 'n' roll is a relatively unpopular style of music in Liyue, having recently been brought over from Fontaine. Xinyan, however, loves the sound — and she's slowly but surely amassing a fanbase of her own as she performs throughout Liyue Harbor.",
    "talentID": 4,
    "photo": "images/Xinyan.png",
    "banner": "images/Banner_Xinyan.png",
    "type": "char",
    "stars": 4,
    "mine": 0
  }
]